[
  {
    "speaker": "Host1",
    "text": "Hey everyone! Welcome back to Friends Weekly, your favorite spot to catch up on all the wild and wonderful stories from our crew. I’m Sarah, and with me as always is the hilarious and quick-witted Mike. Mike, are you ready for some absolute chaos from Lenny?"
  },
  {
    "speaker": "Host2",
    "text": "Oh, I was born ready. Lenny never fails to bring the heat. So what’s the latest? I heard something about a wine night that turned into a full-on movie?"
  },
  {
    "speaker": "Host1",
    "text": "Yes! Get this. Lenny told us about this wine Wednesday outing that was basically a rom-com in real life. He said this guy was a total menace on the dance floor, shooting his shot like a pro, but in the most awkward way possible."
  },
  {
    "speaker": "Host2",
    "text": "No way. I’m picturing this guy just going full-on smooth criminal but actually tripping over his own feet. Classic."
  },
  {
    "speaker": "Host1",
    "text": "Exactly. And then Lenny said the dude actually asked a girl to pack a 12 together and she was like, 'I can't let my sister see you, you’re all mine.' The whole thing sounds like a rom-com script."
  },
  {
    "snippet": "1_big_life_update_about_getting_married_delivered_in_a_casual_and_funny_way.mp3"
  },
  {
    "speaker": "Host2",
    "text": "Wait, hold up! Did he just casually drop that he got married in the middle of all this madness? That’s so Lenny! Only he could slip a major life update like that in between talking about wine and wild nights."
  },
  {
    "speaker": "Host1",
    "text": "Right? And then he goes on about watching sports he has no clue about, fixing his car a bunch, and even diving in Mexico where he threw up and fish literally feasted on it. I mean, who else but Lenny?"
  },
  {
    "speaker": "Host2",
    "text": "That’s a whole mood. Diving and then becoming fish food? This is why he’s our favorite. Also, living in Seattle sounds like it’s treating him well, even if it means watching sports he doesn’t care about just to pass time."
  },
  {
    "speaker": "Host1",
    "text": "Totally. It’s like he’s making the most of every moment, whether it’s wild nights out or big life changes like marriage. So proud of him! Alright, moving on to our next friend’s story. But man, if you think Lenny’s week was wild, wait until you hear what’s coming up next..."
  },
  {
    "speaker": "Host2",
    "text": "Oh boy, buckle up everyone. This is Friends Weekly after all!"
  },
  {
    "speaker": "Host1",
    "text": "Thanks for tuning in, everyone! Huge shoutout to Lenny for sharing all those amazing stories. We love getting the inside scoop on your adventures. Next week, we have even more fun updates from the crew, so don’t miss it!"
  },
  {
    "speaker": "Host2",
    "text": "Absolutely! Until next time, keep living your best life and remember—we’re all just one crazy story away from making someone laugh. Catch you later!"
  }
]